{
  "name": "Dugi Surdulli",
  "title": "Senior Software Engineer",
  "location": "Calgary, Canada",
  "introduction": "I'm an experienced Senior Software Engineer with **10 years** of experience in delivering products that serve millions of users. Specializing in frontend architecture and engineering leadership, with a strong focus on accessibility, user experience, and creating scalable frontend code bases.",
  "contact": {
    "email": "hello@dugi.dev",
    "website": "https://dugi.dev"
  },
  "skills": {
    "languages": [
      "TypeScript",
      "JavaScript",
      "PHP",
      "Go"
    ],
    "frameworks": [
      "React",
      "Next.js",
      "Laravel",
      "Tailwind",
      "TanStack Query",
      "React Hook Form",
      "Zod",
      "Redux",
      "Jotai",
      "Chakra UI",
      "Vanilla Extract"
    ],
    "misc": [
      "Agile",
      "Scrum",
      "Git",
      "JIRA",
      "Docker"
    ]
  },
  "experience": [
    {
      "company": null,
      "role": "Independent Contractor",
      "location": "Remote",
      "startDate": "Jan 2018",
      "endDate": null,
      "description": "As an Independent Contractor, I have provided guidance, leadership, and direct code contributions to various organizations, from SaaS startups, to web agencies.",
      "accomplishments": [
        "Coordinated the engineering discovery phase of Are Media on behalf of XWP.co. This earned XWP **$1 million+** of revenue and a long term partnership with Are Media.",
        "Led creation of frontend starter kit at XWP.co, which was adopted company-wide, speeding up delivery time for frontend work by **40%**.",
        "Led project of transforming the legacy React web app into a monorepo style architecture. Converted the code base to TypeScript, created a design system library and created a modern the API client. This greatly improved developer experience, increased collaboration with design team, and increased development speed by **50%**."
      ]
    },
    {
      "company": "Tally",
      "role": "Senior Frontend Engineer",
      "location": "San Francisco (Remote)",
      "startDate": "Jul 2023",
      "endDate": "Apr 2024",
      "description": "As a Senior Frontend Engineer at Tally, I led the development of various frontend projects within the Web SDK as part of the Web team.",
      "accomplishments": [
        "Identified need for scaling our system such that multiple entry points to the SDK can be offered to our users.",
        "Took initiative in creating technical specification documents for multiple approaches to tackle this situation.",
        "Thoroughly discussed specs with the product and engineering team. Implemented the spec the teams agreed on.",
        "This resulted in greatly improved developer experience, developing new SDK entry points became **90%** faster, and meeting delivery goals with our partner."
      ]
    },
    {
      "company": "Symend",
      "role": "Senior Frontend Engineer",
      "location": "Calgary (Remote)",
      "startDate": "Aug 2022",
      "endDate": "Mar 2023",
      "description": "As a Senior Frontend Engineer at Symend, I led the multiple frontend projects. Worked with many stakeholders to facilitate feature development to ensure delivery in time for a major migration.",
      "accomplishments": [
        "Noticed a gap in collaboration between frontend team and backend teams, which caused delays in delivery of features.",
        "Discussed this with my team lead, who encouraged me to pursue this further and develop a plan to tackle this problem.",
        "Wrote documentation on a short term and long term plan to increase collaboration between the teams. Short term plan was to have API design meetings, such that teams are aligned in an ednpoint's design; Long term plan was to introduce OpenAPI docs and standardize common query parameters.",
        "This reduced the friction in development on both the frontend and backend, which increased productivity and sped up the development of features."
      ]
    },
    {
      "company": "Necara",
      "role": "Software Engineer",
      "location": "Mainz, Germany",
      "startDate": "Dec 2016",
      "endDate": "Sept 2018"
    },
    {
      "company": "Manaferra",
      "role": "Software Engineer",
      "location": "Prishtina, Kosovo",
      "startDate": "Oct 2014",
      "endDate": "Oct 2016"
    }
  ],
  "education": {
    "degree": "BSc in Computer Science",
    "university": "University of London",
    "startDate": "Sept 2021",
    "endDate": null
  }
}