{
  "name": "Doug Surdulli",
  "title": "Senior Software Engineer",
  "location": "Calgary, Canada",
  "introduction": "I am an experienced Senior Software Engineer with **10 years** of expertise in delivering high-impact products to millions of users across diverse industries, including fintech, legal-tech, insurance-tech, and web agencies. I specialize in frontend architecture and engineering leadership, with a strong focus on accessibility, UX, and building scalable codebases.",
  "contact": {
    "email": "hello@dsur.dev",
    "website": "https://dsur.dev",
    "linkedin": "https://www.linkedin.com/in/dsur/"
  },
  "skills": {
    "languages": [
      "TypeScript",
      "JavaScript",
      "PHP",
      "Go"
    ],
    "frameworks": [
      "React",
      "Next.js",
      "Vue",
      "Laravel",
      "Tailwind",
      "TanStack Query",
      "React Hook Form",
      "Zod",
      "Redux",
      "Jotai",
      "Chakra UI",
      "Vanilla Extract"
    ],
    "misc": [
      "Agile",
      "Scrum",
      "Git",
      "JIRA",
      "Docker"
    ]
  },
  "experience": [
    {
      "company": null,
      "role": "Independent Contractor",
      "location": "Remote",
      "startDate": "Jan 2018",
      "endDate": null,
      "description": "As an Independent Contractor, I have provided guidance, leadership, and direct code contributions to various organizations, from SaaS startups, to web agencies.",
      "accomplishments": [
        "Led engineering discovery at XWP for Are Media, securing **$1M+** in revenue and a long-term partnership.",
        "Developed company-wide frontend starter kit at XWP, improving delivery time by **40%**.",
        "Transformed a legacy React app into a monorepo with TypeScript, boosting development speed by **50%**.",
        "Led the creation of design system libraries, which streamlined the creation of apps.",
        "Invented a novel solution to a complex React rendering issue where simple SSR wasn't possible. [See blog](https://xwp.co/how-we-built-a-world-first-rendering-solution-for-ofx/).",
        "Skills: TypeScript, JavaScript, HTML, CSS, React, Next.js, Storybook, accessibility, web performance, design systems."
      ]
    },
    {
      "company": "Tally",
      "role": "Senior Frontend Engineer",
      "location": "San Francisco (Remote)",
      "startDate": "Jul 2023",
      "endDate": "Apr 2024",
      "description": "As a Senior Frontend Engineer at Tally, I led the development of various frontend projects within the Web SDK during a business pivot from B2C to B2B.",
      "accomplishments": [
        "Scaled Web SDK with multiple entry points, reducing new development time by **90%** for similar features.",
        "Led web authentication integration, collaborating across mobile, backend, and web teams.",
        "Led end-to-end feature development, collaborating with stakeholders to define specifications and delegating tasks to mid-level engineers, improving team efficiency by **30%**.",
        "Skills: TypeScript, HTML, CSS, React, Next.js, SDK development, iframe API, design system, accessibility."
      ]
    },
    {
      "company": "Symend",
      "role": "Senior Frontend Engineer",
      "location": "Calgary (Remote)",
      "startDate": "Aug 2022",
      "endDate": "Mar 2023",
      "description": "As a Senior Frontend Engineer at Symend, I led multiple frontend projects and delivered them successfully. Worked with many stakeholders to facilitate feature development to ensure delivery on time for a major migration.",
      "accomplishments": [
        "Improved cross-team collaboration with API design meetings and **OpenAPI** documentation.",
        "Implemented **Playwright** for end-to-end testing, enhancing code confidence and reducing regressions significantly.",
        "Led feature development, working closely with stakeholders to create clear specs and deliver effective, high-quality solutions.",
        "Skills: TypeScript, HTML, CSS, React, Vite, Playwright, multi-tenancy, msw."
      ]
    },
    {
      "company": "Necara",
      "role": "Software Engineer",
      "location": "Mainz, Germany",
      "startDate": "Dec 2016",
      "endDate": "Sept 2018"
    },
    {
      "company": "Manaferra",
      "role": "Software Engineer",
      "location": "Prishtina, Kosovo",
      "startDate": "Oct 2014",
      "endDate": "Oct 2016"
    }
  ],
  "education": {
    "degree": "BSc in Computer Science",
    "university": "University of London",
    "startDate": "Sept 2021",
    "endDate": null
  }
}