{
  "name": "Dugi Surdulli",
  "title": "Senior Software Engineer",
  "location": "Calgary, Canada",
  "introduction": "I am an experienced Senior Software Engineer with **10 years** of expertise in delivering high-impact products to millions of users across diverse industries, including fintech, legal-tech, insurance-tech, and web agencies. I specialize in frontend architecture and engineering leadership, with a strong focus on accessibility, user experience, and building scalable, maintainable codebases.",
  "contact": {
    "email": "hello@dugi.dev",
    "website": "https://dugi.dev"
  },
  "skills": {
    "languages": [
      "TypeScript",
      "JavaScript",
      "PHP",
      "Go"
    ],
    "frameworks": [
      "React",
      "Next.js",
      "Laravel",
      "Tailwind",
      "TanStack Query",
      "React Hook Form",
      "Zod",
      "Redux",
      "Jotai",
      "Chakra UI",
      "Vanilla Extract"
    ],
    "misc": [
      "Agile",
      "Scrum",
      "Git",
      "JIRA",
      "Docker"
    ]
  },
  "experience": [
    {
      "company": null,
      "role": "Independent Contractor",
      "location": "Remote",
      "startDate": "Jan 2018",
      "endDate": null,
      "description": "As an Independent Contractor, I have provided guidance, leadership, and direct code contributions to various organizations, from SaaS startups, to web agencies.",
      "accomplishments": [
        "Coordinated the engineering discovery phase of Are Media on behalf of XWP.co. This earned XWP **$1 million+** of revenue and a long term partnership with Are Media.",
        "Led creation of frontend starter kit at XWP.co, which was adopted company-wide, speeding up delivery time for frontend work by **40%**.",
        "Led project of transforming the legacy React web app into a monorepo style architecture. Converted the code base to TypeScript, created a design system library and created a modern the API client. This greatly improved developer experience, increased collaboration with design team, and increased development speed by **50%**.",
        "Designed and implemented a novel solution to a complex React rendering issue where simple SSR wasn't possible. [See blog](https://xwp.co/how-we-built-a-world-first-rendering-solution-for-ofx/)."
      ]
    },
    {
      "company": "Tally",
      "role": "Senior Frontend Engineer",
      "location": "San Francisco (Remote)",
      "startDate": "Jul 2023",
      "endDate": "Apr 2024",
      "description": "As a Senior Frontend Engineer at Tally, I led the development of various frontend projects within the Web SDK as part of the Web team.",
      "accomplishments": [
        "Led the initiative to scale the system by creating multiple SDK entry points, which was essential to building a feature. Developed technical specifications, facilitated team discussions, and implemented the chosen solution, reducing development time for new entry points by **90%** and improving developer experience while meeting partner delivery goals.",
        "Led the implementation of authentication for the web team, collaborating with stakeholders across mobile platform and backend teams to design a unified solution. Oversaw the integration on the web, ensuring it was secure, dev-friendly, thoroughly tested, and fully matched the specification document."
      ]
    },
    {
      "company": "Symend",
      "role": "Senior Frontend Engineer",
      "location": "Calgary (Remote)",
      "startDate": "Aug 2022",
      "endDate": "Mar 2023",
      "description": "As a Senior Frontend Engineer at Symend, I led the multiple frontend projects. Worked with many stakeholders to facilitate feature development to ensure delivery on time for a major migration.",
      "accomplishments": [
        "Identified a gap in collaboration between frontend and backend teams that caused feature delays. Developed and documented a short-term plan to introduce API design meetings for better alignment, and a long-term plan to implement **OpenAPI** documentation and standardize query parameters. This improved cross-team communication, reduced development friction, and sped up feature delivery.",
        "Identified the need to improve code confidence beyond unit and component tests for the frontend team. Led the initiative to advocate for and implement end-to-end testing using **Playwright**, gaining team buy-in and successfully setting up the framework. This resulted in a significant boost in confidence that delivered features were functioning as intended."
      ]
    },
    {
      "company": "Necara",
      "role": "Software Engineer",
      "location": "Mainz, Germany",
      "startDate": "Dec 2016",
      "endDate": "Sept 2018"
    },
    {
      "company": "Manaferra",
      "role": "Software Engineer",
      "location": "Prishtina, Kosovo",
      "startDate": "Oct 2014",
      "endDate": "Oct 2016"
    }
  ],
  "education": {
    "degree": "BSc in Computer Science",
    "university": "University of London",
    "startDate": "Sept 2021",
    "endDate": null
  }
}